[
	{
		"id":"process",
		"short_name":"process",
		"number":0,
		"name":"Software Design Process",
		"description":"What is the \"Correct\" way to design software? Ask a dozen designers and you will get two dozen responses. We will briefly explore some of the processes out there and discuss the tradeoffs between them.",
		"time":[1],
		"objectives":[
			{"name":"Understand the stages of software design"},
			{"name":"Understand that the software design process is varied based on where you are and the type of work you are doing"}
		]
	},
	{
		"id":"graphics",
		"number":1,
		"short_name":"graphic design",
		"name":"Graphic Design 101",
		"description":"The visual design of software directly impacts how users perceive the product as well as how software is comprehended and used. The course will start with a brief introduction to a few of the tenets of graphic design and some general guidelines for how to apply these tenets to the design of software.",
		"time":[2,3],
		"subtopics":[
			{"name":"Designing with a Grid"},
			{"name":"Typography"},
			{"name":"The use of color"},
			{"name":"Balance"},
			{"name":"Removing excess ink"}
		],
		"objectives":[
			{"name":"Layout a screen based on the graphic design principles presented (grids, typography, color, balance)"},
			{"name":"Critique a good or bad design to explain why it is visually pleasing or visually appalling."}
		]
	},
	{
		"id":"realdata",
		"number":2,
		"short_name":"real data",
		"name":"Designing With Real Data",
		"description":"When designing experiences that require users to make actionable decisions, it is virtually impossible to evaluate the success or failure of a design without real data present in the mockup or prototype. This is why designing with real data is critical to evaluating the success of a design. During this section, we will look at how to gather real data, understand that data and how to integrate it into your designs",
		"time":[4,5,6],
		"subtopics":[
			{"name":"The importance of designing with real data"},
			{"name":"Real data has a story!"},
			{"name":"Basic Web Scraping using ScreenScraper and kimono"},
			{"name":"Basic Python, Excel, Sublime Text data modification"}
		],
		"objectives":[
			{"name":"Gather real data from websites via screen scraping and other techniques"},
			{"name":"Identify the story that a dataset tells"},
			{"name":"Create a realistic dataset when a real dataset is not available"},
			{"name":"Integrate data into a design"}
		]
	},
	{
		"id":"prototyping",
		"short_name":"prototyping",
		"number":3,
		"name":"Rapidly Prototyping Software Experiences",
		"description":"As software becomes more and more interactive, the modern software designer can no longer afford to hide behind the static mockup. Some experiences can only be truly evaluated by interacting with a prototype of a design or experience. But not all prototypes are created equally. We will look at how to decide when to prototype and what to prototype. We will also cover specific techniques for building interactive prototypes very quickly.",
		"time":[7,8],
		"subtopics":[
			{"name":"Determining the goal of a prototype"},
			{"name":"Choosing the correct tools for a prototype"},
			{"name":"Techniques and tools for building prototypes"}
		],
		"objectives":[
			{"name":"Determine the appropriate fidelity and tools for developing a prototype of a specific workflow"},
			{"name":"Build a prototype of a small workflow"}
		]
	},
	{
		"id":"data_viz",
		"short_name":"data viz",
		"number":4,
		"name":"Data Visualization",
		"description":"Data Visualization is becoming a critical part of modern applications so it is important for software designers to understand how to design successful and accurate visualizations. We will go through techinques for data visualizations, review Edward Tufte's principles of data visualization and look at some tools for building interactive data visualizations",
		"time":[9,10,11],
		"subtopics":[
			{"name":"Tufte Principles"},
			{"name":"Types of information and the different visualizations techniques for that information"},
			{"name":"How to critique visualizations"},
			{"name":"Tools for creating visualizations"},
		],
		"objectives":[
			{"name":"Design a self-contained data visualization"},
			{"name":"Critique data visualization to identify if it is properly using techniques"}
		]
	},
	{
		"short_name":"software development",
		"id":"development",
		"number":5,
		"name":"Software Development",
		"description":"What you design doesn't matter until it is actually built. In the same way that an architect needs to understand how buildings are built in order to design them, software designers need to understand how software is built. During this section we will look at modern web and mobile architectures and discuss how these technology choices should influence the design process. Additionally, we will look at how to break down designs into a development plan",
		"time":[12,13],
		"subtopics":[
			{"name":"Common Application Architectures"},
			{"name":"Software Development Process"},
			{"name":"Technologies for building applications"},
			{"name":"Implementation Planning"}
		],
		"objectives":[
			{"name":"Explain the difference from a technical and a user experience perspective of various technology architectures"},
			{"name":"Break a design up into functional chunks for implementation"}
		]
	}

]