{
	"week":2,
	"topic":"graphics",
	"description":"This week, we start exploring some of the principles of graphic design as they relate to software design. We will extend the concepts presented in <em>The Non-Designer's Design Book</em> with some general rules. As with any rules, we will also discuss when to break the rules.",
	"activities":[
		{
			"name":"One More Process Example",
			"type":"lecture",
			"time":10,
			"description":"So that you have another example, we'll walk through, briefly, the design process we use at Involution and look at some examples of design artifacts."
		},
		{
			"name":"Group Activity: Discuss What We Think Makes Things Visually Appealing",
			"type":"group",
			"time":20,
			"description":"In your groups, discuss the screenshots you brought in. What makes them visually appealing? What makes them visually appalling? Think about the Consistency, Repetition, Alignment, and Proximity that was presented in the reading. Present one as a group.",
			"results":{
				"summary":"In this discussion, we went through the examples students brought in. We found that many of the \"visually pleasing\" examples that were shown are actually relatively simple websites without much content (for instance Apple's website or Coin's website). Another example was a GNU command line manual, which presents information very succintly but does not actually look very nice.",
				"meta":"This discussion went pretty well. I made the mistake of not requiring students to bring in examples of screens (In fact, I explicitly said that it didn't have to be software). This cause some issues because we were trying to use some of the more software based principles to judge photos. It was also helpful to have some examples prepared myself."
			}
		},
		{
			"name":"Lecture: Achieving Structure and Visual Hierarchy",
			"type":"lecture",
			"time":30,
			"description":"Structure and Visual Hierarchy are two of the most important principles when designing software. We will build on the topics from the reading and go through a handful of examples and rules.",
			"instructor_notes":"Contrast, Repetition, Alignment, Proximity
			Repetition: Fonts, Colors, Margins,... Font Treatment = type, size, color, style; Count the fonts; desgine fonts up front. Always use them. If not, add a new one. Choose a set of colors. For enterprise software, we do lots of greys. It lets the content shine 
			Margins… but this is also about alignment 
			Alignment: ALWAYS line things up. Left alignment > right alignment (generally) > centered 
			Contrast: If things are not identical, make them very different. This is true with fonts, colors, etc. P
			roximity: Arrange similar information together. If things are supposed to be together, make them closer together. In all these cases, examples!",
			"attachments":[
				{
					"link":"week2/graphic_design_v01.pdf",
					"title":"Slides",
					"type":"download"
				}
			],
			"results":{
				"meta":"This lecture went pretty well. I think there was a good balance of examples and rules of thumb. I wish I had gotten into a few more software based principles (such as drawing attention towards actions we want to take)."
			}
		},
		{
			"name":"Group Activity: Critique a Screen",
			"time":30,
			"description":"Each group will be given a web site and a large printout of a particular screen. Based on the lecture, make suggestions of how to improve the design.",
			"attachments":[
				{
					"link":"week2/weather_screens.pdf",
					"title":"Example Screens",
					"type":"download"
				}
			],
			"results":{
				"summary":"Different groups of students took different approaches to this discussion. All together, most students cited the lack of visual hierarchy in the examples. Likewise, alignment and the overuse of fonts came up quite a bit. There was also a common thread about how the ads on a screen often fight for the attention.",
				"documents":[
					{
						"type":"photo",
						"location":"internal",
						"caption":"Counting fonts on weather.com. ",
						"link":"files/week2/weather_dot_com.jpg"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"This group identified the lack of spacing in the top left weather presentation as a problem.",
						"link":"files/week2/intellicast.jpg"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"This group generally liked what Yahoo has to offer.",
						"link":"files/week2/yahoo.jpg"
					}
				],
				"meta":"This exercise went quite well. It gave students a chance to practice some of the techniques we had discussed. I think it was good to print out the screens on large paper (24in x 24in)."
			}
		}
	],
	"assignments":[
		{
			"description":"If you haven’t used InDesign/Illustrator before: watch <a href=\"https://www.youtube.com/watch?v=JfhHvAscNFA\">https://www.youtube.com/watch?v=JfhHvAscNFA</a>",
			"required":true,
			"type":"video"
		},
		{
			"description":"Take the example screen you had at the end of class and translate a portion of it into InDesign or Illustrator. Get familiar with the basic tools presented in the above video as we will be using InDesign in class next week",
			"required":true,
			"type":"other"
		},
		{
			"description":"Read Chapter 7: Using Color of <em>The Non-Designer's Design Book</em>",
			"required":false,
			"type":"reading"
		},
		{
			"description":"Read about Typography in Chapters 9-11 of <em>The Non-Designer's Design Book</em>",
			"required":false,
			"type":"reading"
		}
	]
	
}