{
	"week":7,
	"topic":"prototyping",
	"description":"The native medium of software designs is code. Sometimes, to really evaluate the quality of a design, you have to experience it its navtive medium. In this class, we'll start talking about prototyping techniques.",
	"activities":[
		{
			"name":"Prototyping and Testing Designs and Ideas: Ross Beyeler, Growth Spark",
			"type":"lecture",
			"time":40,
			"description":"Ross Beyeler is the founder of local web design and strategy firm <a href=\"http://www.growthspark.com\">Growth Spark</a>. Ross, who graduated from Babson in 2009, will be speaking about how Growth Spark tests ideas and designs from a usability and business value perspective.",
			"attachments":[
				{
					"link":"http://www.slideshare.net/growthspark/prototyping-a-conversation-about-your-assumptions",
					"title":"Ross's Slides",
					"type":"link"
				},
			],
			"results":{
				"summary":"Ross's talk provided a very good introduction to the type of protyping that GrowthSpark does as well as a good introduction to a broad list of tools they use.",
				"meta":"Bringing in opinions other than my own is good."
			}

		},
		{
			"name":"Introduction to jQuery, CSS, HTML",
			"time":50,
			"description":"A cursory and (hopefully) practical introduction to HTML, CSS, jQuery and maybe a few other javascript libraries thrown in for good measure.",
			"attachments":[
				{
					"link":"../../html_intro.html",
					"title":"HTML Samples",
					"type":"link"
				},
				{
					"link":"week7/template.zip",
					"title":"HTML Template",
					"type":"download"
				},
				{
					"link":"week7/completed.zip",
					"title":"Class Example",
					"type":"download"
				},
				{
					"link":"https://www.youtube.com/watch?v=RZ-bJ77bxvo",
					"title":"Video of Class Example",
					"type":"link"
				}
			],
			"results":{
				"summary":"In this talk, I walked through an example of building a fairly involved prototype in real time.",
				"meta":"This example was too fast for much of the class. I, again, forgot that students didn't have much experience with javascript and css, and so the very detailed oriented introduction did not work as well as I hoped. It would have been better to do a simpler example so that the key concepts really got across."
			}
		}			
	],
	"assignments":[
		{
			"description":"Layout a resume or home page in HTML and CSS. The goal of this exercise is to get you familiar with some of the intricacies of HTML and CSS. If you are already comfortable in HTML/CSS, feel free to go deeper."
		}
		
	]
	
}