{
	"week":1,
	"topic":"process",
	"description":"This week we will start by going through introductions of the class (based on the results of <a href=\"https://docs.google.com/forms/d/1RC8TXqoXpd5uQMyOZAD7fO4c1KFmBrnjnCKTOfDcw_8/viewform?usp=send_form\">the survey</a>) and I will briefly introduce the topics we will be covering. We will then discuss how we think software design should be designed.",
	"activities":[
		{
			"name":"Instructor Introduction",
			"time":10,
			"description":"Ben introduces himself to the students. Shows examples of work and his background"
		},
		{
			"name":"Course Introduction",
			"time":10,
			"description":"Talks about software design at a high level and provides an overview of the course",
			"attachments":[
				{
					"link":"abc.html",
					"title":"Slides",
					"description":"These are the slides"
				}
			]
		},
		{
			"name":"Student Introduction",
			"time":10,
			"description":"Review results of intro survey"
		},

		{
			"name":"What is “Good Design",
			"time":20,
			"description":"Have students post up their examples of good and bad design on the board. Discuss what it is about the designs that is good or bad. Have each group decide on 5 principles that make a design good or bad."
		},

		{
			"name":"Software Design Process",
			"time":30,
			"description":"Have the groups discuss how software should be designed. What are the different activities and how much of each should happen? Outline where the topics we are covering in the class fit in with these.",
			"instructor_notes":"The birth of a piece of software… where does a software design come from? User research? Business direction? Legacy rewrite? How does this influence the design process?Present a couple of software design processes that I’ve seen. Show examples of each step. Discuss tradeoffs between focusing narrowly or broadly."
		}
	],
	"assignments":[
		{
			"description":"Make sure InDesign is installed on your laptop. Illustrator is an okay substitute, if need be.",
			"required":true,
			"type":"other"
		},
		{
			"description":"Read http://www.markboulton.co.uk/journal/visual-design-is-not-a-thing",
			"required":true,
			"type":"reading"
		},
		{
			"description":"Read pages 1-80 of The Non-Designer’s Design Book",
			"required":true,
			"type":"reading"
		},
		{
			"description":"Bring an example, printed out, of something that is visually pleasing. Bring an example of something that is not.",
			"required":true,
			"type":"other"
		},
		{
			"description":"Read http://www.visualmess.com/",
			"required":false,
			"type":"reading"
		}
	]
}