{
	"week":4,
	"topic":"realdata",
	"description":"This week we are diving into techniques for gathering real data and incorporating it into your designs.",
	"activities":[
		{
			"name":"Present your Dataset",
			"type":"group",
			"time":15,
			"description":"Give a 1 minute overview of your dataset",
			"results":{
				"summary":"Students came up with some great datasets to showcase",
				"documents":[
					{
						"type":"photo",
						"location":"internal",
						"caption":"Activity peaks on the weekends. The low points are when he is sitting in his SCOPE workspace all day",
						"link":"files/week4/datasets/activity.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"Mobile data usage was really high during his internship, almost none during vacation and is starting to get back to normal",
						"link":"files/week4/datasets/data.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"The internships one student applied to last year",
						"link":"files/week4/datasets/internships.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"The number of photos taken over the summer",
						"link":"files/week4/datasets/photos.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"Location data highlights weekend trips in Seattle",
						"link":"files/week4/datasets/seattle.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"Sleep data for one student, showing the hours slept each night",
						"link":"files/week4/datasets/sleep1.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"The quality of sleep for the same student is highly coorrelated to the amount of sleep each night",
						"link":"files/week4/datasets/sleep2.png"
					},
					{
						"type":"photo",
						"location":"internal",
						"caption":"A different student's sleep data over the last two and a half years highlights that they sleep more as an upper classman",
						"link":"files/week4/datasets/SleepData.png"
					}
				],
				"meta":"It was really neat to see the datasets the students came up with. They provided a good introduction to characteristics of real data."
			}
		},
		{ 
			"name":"Characteristics of Real Data",
			"type":"lecture",
			"time":10,
			"description":"Real Data has a story. It is your job to understand and extract that story and align it with the user's goals.",
			"attachments":[
				{
					"link":"week4/understanding_data_v01.pdf",
					"title":"Slides",
					"type":"download"
				}
			]
		},
		{
			"name":"Gathering Real Data",
			"type":"demo",
			"time":30,
			"description":"Oftentimes we can see the data we want to include in our design somewhere on the internet. During this demo, we'll walk through a few tools to actually go and grab that data. As part of that, we'll look at one example of what you might do once you have the data.",
			"attachments":[
				{
					"link":"week4/tools_for_data_v01.pdf",
					"title":"Slides",
					"type":"download"
				}
			],
			"results":{
				"summary":"This talk outlined how to use Kimono, Screen Scraper, and Sublime Text to gather and edit data.",
				"meta":"The planned demo for this talk didn't work as planned, but the talk was still effective overall."
			}
		},
		{
			"name":"Scrape Some Data",
			"type":"group",
			"time":30,
			"description":"In your group, work together to scrape some data using the tools we just discussed. Here are a few links that you might try.<ul>
				<li>Grab attendees of particular conferences at <a href=\"www.lanyrd.com\">Lanyrd</a></li>
				<li>Get telephone numbers at <a href=\"http://www.yellowpages.com/\">Yellow Pages</a></li>
				<li>Get restuarant details at <a href=\"http://www.yelp.com/\">Yelp</a></li>
				<li>Get tweets from <a href=\"http://www.twitter.com/\">Twitter</a></li>
				<li>Grab weather data from <a href=\"http://www.weather.com/\">Weather.com</a></li>
				<li>Get e-mail subjects from <a href=\"http://gmail.com/\">Gmail</a></li>
				<li>Get calendar appointments from <a href=\"https://www.google.com/calendar/\">Google Calendar</a></li>
				<li>Get products from a search on <a href=\"http://www.amazon.com/\">Amazon</a></li>
				<li>Gather data about security vulnerabilities from <a href=\"http://nvd.nist.gov/\">the National Vulnerability Database</a></li>
				<li>Gather release activity or commit analytics or tags from <a href=\"http://github.com\">Github</a></li>
				</ul>",
				"results":{
				"summary":"Students did a very good job of scraping data from many of the websites listed above.",
				"meta":"This activity went pretty well. Shortly after starting I realized that I should have provided an introduction to CSS selectors. There were lots of questions, but I could tell that students were getting more comfortable with the tools over the course of the activity."
			}
		}
	],
	"assignments":[
		{
			"description":"Using some of the tools we used in class, gather data for 3+ sources. Keep in mind that it might not be feasible to actually gather data using the tools we discussed from every website. Get the data to the point where you can visualize it in some manner. This could be a simple plot in MATLAB or Excel or using the InDesign DataMerge feature to show the information. The assignment for next week will have you use this data to design a screen."
		},
		{
			"description":"Review CSS selectors, if you aren't familiar with them. <a href=\"http://www.sitepoint.com/web-foundations/css-selectors/\">SitePoint</a> has a good resource. <a href=\"http://flukeout.github.io/\">This app</a> also has a really cute and fun way to test your selector skills",
			"required":false
		}

	]
	
}